Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_gpio_stm32l4.c
/*!
 * @file      smtc_hal_mcu_gpio_stm32l4.c
 *
 * @brief      Implementation of GPIO module on top of STM32L4 Low Level drivers
 *
 * The Clear BSD License
 * Copyright Semtech Corporation 2022. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the Semtech corporation nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SEMTECH CORPORATION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * -----------------------------------------------------------------------------
 * --- DEPENDENCIES ------------------------------------------------------------
 */

#include "stm32l4xx.h"
#include "smtc_hal_mcu_gpio.h"
#include "smtc_hal_mcu_gpio_stm32l4.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_exti.h"
#include "stm32l4xx_ll_system.h"
#include <stddef.h>
#include <stdbool.h>

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE MACROS-----------------------------------------------------------
 */

/**
 * @brief Maximum number of GPIO configured as input with interruption
 */
#ifndef SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE
#define SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE 16
#endif

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE CONSTANTS -------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE TYPES -----------------------------------------------------------
 */

typedef struct
{
    uint32_t syscfg_exti_port;
    uint32_t syscfg_exti_line;
    uint32_t exti_line;
    int      irq_number;
} smtc_hal_mcu_gpio_irq_exti_cfg_t;

typedef struct smtc_hal_mcu_gpio_irq_cfg_s
{
    bool                             is_irq_enabled;
    smtc_hal_mcu_gpio_input_cfg_t    input_cfg;
    smtc_hal_mcu_gpio_irq_exti_cfg_t exti_cfg;
} smtc_hal_mcu_gpio_irq_cfg_t;

struct smtc_hal_mcu_gpio_inst_s
{
    bool                        is_cfged;
    GPIO_TypeDef*               port;
    uint32_t                    pin;
    bool                        is_irq_cfged;
    smtc_hal_mcu_gpio_irq_cfg_t irq_cfg;
};

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE VARIABLES -------------------------------------------------------
 */

/**
 * @brief Array to store the configuration of initialized GPIO with IRQ
 */
static struct smtc_hal_mcu_gpio_inst_s gpio_inst_array[SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE];

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DECLARATION -------------------------------------------
 */

/**
 * @brief Check if a GPIO is configured
 *
 * @param [in] cfg GPIO configuration
 *
 * @retval true GPIO configured
 * @retval false GPIO not configured
 */
static bool smtc_hal_mcu_gpio_stm32l4_is_configured( smtc_hal_mcu_gpio_cfg_t cfg );

/**
 * @brief Get a pointer to the first free slot
 *
 * @retval Pointer to the first free slot - NULL if there is no space left
 */
static struct smtc_hal_mcu_gpio_inst_s* smtc_hal_mcu_gpio_stm32l4_get_free_slot( void );

/**
 * @brief Check if the instance given as parameter is genuine
 *
 * @param [in] inst GPIO instance
 *
 * @retval true Instance is genuine
 * @retval false Instance is not genuine
 */
static bool smtc_hal_mcu_gpio_stm32l4_is_real_inst( smtc_hal_mcu_gpio_inst_t inst );

/**
 * @brief Enable peripheral clock for a given GPIO port
 *
 * @param [in] port GPIO port
 *
 * @retval SMTC_HAL_MCU_STATUS_OK Clock successfully enabled
 * @retval SMTC_HAL_MCU_STATUS_BAD_PARAMETERS At least one parameter has an incorrect value
 */
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_enable_clock( GPIO_TypeDef* port );

/**
 * @brief Disable peripheral clock for a given GPIO port
 *
 * @param [in] port GPIO port
 *
 * @retval SMTC_HAL_MCU_STATUS_OK Clock successfully disabled
 * @retval SMTC_HAL_MCU_STATUS_BAD_PARAMETERS At least one parameter has an incorrect value
 */
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_disable_clock( GPIO_TypeDef* port );

/**
 * @brief Get the EXTI configuration for the given instance
 *
 * @param [in] inst GPIO instance
 * @param [out] exti_cfg EXTI configuration
 *
 * @retval SMTC_HAL_MCU_STATUS_OK Successfully obtained the EXTI configuration
 * @retval SMTC_HAL_MCU_STATUS_BAD_PARAMETERS At least one parameter has an incorrect value
 */
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_get_exti_cfg( smtc_hal_mcu_gpio_inst_t          inst,
                                                                     smtc_hal_mcu_gpio_irq_exti_cfg_t* exti_cfg );

/**
 * @brief Get the trigger mode for a given HAL MCU GPIO interrupt mode
 *
 * @param [in] mode HAL MCU GPIO interrupt mode
 * @param [out] trigger STM32L4xx trigger
 *
 * @retval SMTC_HAL_MCU_STATUS_OK Successfully obtained trigger mode
 * @retval SMTC_HAL_MCU_STATUS_BAD_PARAMETERS At least one parameter has an incorrect value
 */
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_get_trigger( smtc_hal_mcu_gpio_irq_mode_t mode,
                                                                    uint32_t*                    trigger );

/**
 * @brief Wrapper that calls the callback function registered on pin \ref pin
 *
 * @param [in] pin GPIO pin
 *
 * @retval SMTC_HAL_MCU_STATUS_OK Successfully called a callback
 * @retval SMTC_HAL_MCU_STATUS_ERROR Did not call any callbacks
 */
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_call_exti_callback( uint32_t pin );

