Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_gpio_stm32l4.c
/*
 * -----------------------------------------------------------------------------
 * --- PUBLIC FUNCTIONS DEFINITION ---------------------------------------------
 */

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_init_output( smtc_hal_mcu_gpio_cfg_t               cfg,
                                                     const smtc_hal_mcu_gpio_output_cfg_t* output_cfg,
                                                     smtc_hal_mcu_gpio_inst_t*             inst )
{
    smtc_hal_mcu_status_t status = SMTC_HAL_MCU_STATUS_ERROR;

    if( smtc_hal_mcu_gpio_stm32l4_is_configured( cfg ) == true )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    struct smtc_hal_mcu_gpio_inst_s* gpio_cfg_slot = smtc_hal_mcu_gpio_stm32l4_get_free_slot( );

    if( gpio_cfg_slot == NULL )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    gpio_cfg_slot->is_cfged     = false;
    gpio_cfg_slot->is_irq_cfged = false;
    gpio_cfg_slot->port         = cfg->port;
    gpio_cfg_slot->pin          = cfg->pin;

    LL_GPIO_InitTypeDef GPIO_InitStruct = {
        .Pin        = gpio_cfg_slot->pin,
        .Mode       = LL_GPIO_MODE_OUTPUT,
        .Speed      = LL_GPIO_SPEED_FREQ_LOW,
        .OutputType = LL_GPIO_OUTPUT_PUSHPULL,
        .Pull       = LL_GPIO_PULL_NO,
    };

    status = smtc_hal_mcu_gpio_stm32l4_enable_clock( gpio_cfg_slot->port );
    if( status != SMTC_HAL_MCU_STATUS_OK )
    {
        return status;
    }

    status = smtc_hal_mcu_gpio_set_state( gpio_cfg_slot, output_cfg->initial_state );
    if( status != SMTC_HAL_MCU_STATUS_OK )
    {
        return status;
    }

    if( LL_GPIO_Init( gpio_cfg_slot->port, &GPIO_InitStruct ) != SUCCESS )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    gpio_cfg_slot->is_cfged = true;

    *inst = gpio_cfg_slot;

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_init_input( smtc_hal_mcu_gpio_cfg_t              cfg,
                                                    const smtc_hal_mcu_gpio_input_cfg_t* input_cfg,
                                                    smtc_hal_mcu_gpio_inst_t*            inst )
{
    smtc_hal_mcu_status_t status = SMTC_HAL_MCU_STATUS_ERROR;

    if( smtc_hal_mcu_gpio_stm32l4_is_configured( cfg ) == true )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    struct smtc_hal_mcu_gpio_inst_s* gpio_cfg_slot = smtc_hal_mcu_gpio_stm32l4_get_free_slot( );

    if( gpio_cfg_slot == NULL )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    gpio_cfg_slot->is_cfged     = false;
    gpio_cfg_slot->is_irq_cfged = false;
    gpio_cfg_slot->port         = cfg->port;
    gpio_cfg_slot->pin          = cfg->pin;

    LL_GPIO_InitTypeDef GPIO_InitStruct = {
        .Pin        = gpio_cfg_slot->pin,
        .Mode       = LL_GPIO_MODE_INPUT,
        .Speed      = LL_GPIO_SPEED_FREQ_LOW,
        .OutputType = LL_GPIO_OUTPUT_OPENDRAIN,
        .Pull       = LL_GPIO_PULL_NO,
    };

    status = smtc_hal_mcu_gpio_stm32l4_enable_clock( gpio_cfg_slot->port );
    if( status != SMTC_HAL_MCU_STATUS_OK )
    {
        return status;
    }

    if( LL_GPIO_Init( gpio_cfg_slot->port, &GPIO_InitStruct ) != SUCCESS )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    if( input_cfg->irq_mode != SMTC_HAL_MCU_GPIO_IRQ_MODE_OFF )
    {
        uint32_t trigger;

        smtc_hal_mcu_gpio_irq_exti_cfg_t exti_cfg;

        status = smtc_hal_mcu_gpio_stm32l4_get_exti_cfg( gpio_cfg_slot, &exti_cfg );
        if( status != SMTC_HAL_MCU_STATUS_OK )
        {
            return status;
        }

        status = smtc_hal_mcu_gpio_stm32l4_get_trigger( input_cfg->irq_mode, &trigger );
        if( status != SMTC_HAL_MCU_STATUS_OK )
        {
            return status;
        }

        gpio_cfg_slot->irq_cfg.input_cfg      = *input_cfg;
        gpio_cfg_slot->irq_cfg.is_irq_enabled = false;
        gpio_cfg_slot->irq_cfg.exti_cfg       = exti_cfg;

        LL_EXTI_InitTypeDef EXTI_InitStruct = {
            .Line_0_31   = gpio_cfg_slot->irq_cfg.exti_cfg.exti_line,
            .Line_32_63  = LL_EXTI_LINE_NONE,
            .LineCommand = ENABLE,
            .Mode        = LL_EXTI_MODE_IT,
            .Trigger     = trigger,
        };

        LL_EXTI_Init( &EXTI_InitStruct );

        gpio_cfg_slot->is_irq_cfged = true;
    }

    gpio_cfg_slot->is_cfged = true;

    *inst = gpio_cfg_slot;

    return status;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_deinit( smtc_hal_mcu_gpio_inst_t* inst )
{
    smtc_hal_mcu_gpio_inst_t inst_local = *inst;

    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst_local ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst_local->is_cfged == false )
    {
        return SMTC_HAL_MCU_STATUS_NOT_INIT;
    }

    LL_GPIO_InitTypeDef GPIO_InitStruct = {
        .Pin        = inst_local->pin,
        .Mode       = LL_GPIO_MODE_ANALOG,
        .Speed      = LL_GPIO_SPEED_FREQ_LOW,
        .OutputType = LL_GPIO_OUTPUT_OPENDRAIN,
        .Pull       = LL_GPIO_PULL_NO,
    };

    if( LL_GPIO_Init( inst_local->port, &GPIO_InitStruct ) != SUCCESS )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    inst_local->is_cfged = false;

    if( inst_local->is_irq_cfged == true )
    {
        if( inst_local->irq_cfg.is_irq_enabled == true )
        {
            smtc_hal_mcu_gpio_disable_irq( inst_local );

            LL_EXTI_InitTypeDef EXTI_InitStruct;

            LL_EXTI_StructInit( &EXTI_InitStruct );

            EXTI_InitStruct.Line_0_31 = inst_local->irq_cfg.exti_cfg.exti_line;

            LL_EXTI_Init( &EXTI_InitStruct );
        }

        inst_local->is_irq_cfged = false;
    }

    bool can_disable_clock = true;

    for( int i = 0; i < SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE; i++ )
    {
        if( gpio_inst_array[i].port == inst_local->port )
        {
            if( gpio_inst_array[i].is_cfged == true )
            {
                can_disable_clock = false;
                break;
            }
        }
    }

    if( can_disable_clock == true )
    {
        smtc_hal_mcu_gpio_stm32l4_disable_clock( inst_local->port );
    }

    *inst = NULL;

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_set_state( smtc_hal_mcu_gpio_inst_t inst, smtc_hal_mcu_gpio_state_t state )
{
    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

