Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_gpio_stm32l4.c
    switch( state )
    {
    case SMTC_HAL_MCU_GPIO_STATE_HIGH:
    {
        LL_GPIO_SetOutputPin( inst->port, inst->pin );
        break;
    }
    case SMTC_HAL_MCU_GPIO_STATE_LOW:
    {
        LL_GPIO_ResetOutputPin( inst->port, inst->pin );
        break;
    }
    default:
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_get_state( smtc_hal_mcu_gpio_inst_t inst, smtc_hal_mcu_gpio_state_t* state )
{
    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    const uint32_t pin_mode = LL_GPIO_GetPinMode( inst->port, inst->pin );

    if( pin_mode == LL_GPIO_MODE_OUTPUT )
    {
        *state = ( LL_GPIO_IsOutputPinSet( inst->port, inst->pin ) == 1 ) ? SMTC_HAL_MCU_GPIO_STATE_HIGH
                                                                          : SMTC_HAL_MCU_GPIO_STATE_LOW;
    }
    else if( pin_mode == LL_GPIO_MODE_INPUT )
    {
        *state = ( LL_GPIO_IsInputPinSet( inst->port, inst->pin ) == 1 ) ? SMTC_HAL_MCU_GPIO_STATE_HIGH
                                                                         : SMTC_HAL_MCU_GPIO_STATE_LOW;
    }
    else
    {
        return SMTC_HAL_MCU_STATUS_NOT_INIT;
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_enable_irq( smtc_hal_mcu_gpio_inst_t inst )
{
    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst->is_irq_cfged == true )
    {
        if( inst->irq_cfg.is_irq_enabled == false )
        {
            LL_SYSCFG_SetEXTISource( inst->irq_cfg.exti_cfg.syscfg_exti_port, inst->irq_cfg.exti_cfg.syscfg_exti_line );
            NVIC_EnableIRQ( inst->irq_cfg.exti_cfg.irq_number );
            NVIC_SetPriority( inst->irq_cfg.exti_cfg.irq_number, 0 );

            inst->irq_cfg.is_irq_enabled = true;

            return SMTC_HAL_MCU_STATUS_OK;
        }
    }

    return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_disable_irq( smtc_hal_mcu_gpio_inst_t inst )
{
    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst->is_irq_cfged == true )
    {
        if( inst->irq_cfg.is_irq_enabled == true )
        {
            NVIC_DisableIRQ( inst->irq_cfg.exti_cfg.irq_number );

            inst->irq_cfg.is_irq_enabled = false;
        }

        return SMTC_HAL_MCU_STATUS_OK;
    }

    return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
}

smtc_hal_mcu_status_t smtc_hal_mcu_gpio_update_callback( smtc_hal_mcu_gpio_inst_t inst, void ( *callback )( void* ),
                                                         void*                    context )
{
    // Return bad parameter status if inst is not a real instance
    if( smtc_hal_mcu_gpio_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    // Return not init status if the instance is not configured as input with interrupt
    if( ( inst->is_cfged == false ) || ( inst->is_irq_cfged == false ) )
    {
        return SMTC_HAL_MCU_STATUS_NOT_INIT;
    }

    // Set the callback and context; then return status Ok
    inst->irq_cfg.input_cfg.callback = callback;
    inst->irq_cfg.input_cfg.context  = context;
    return SMTC_HAL_MCU_STATUS_OK;
}

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITION --------------------------------------------
 */

static bool smtc_hal_mcu_gpio_stm32l4_is_configured( smtc_hal_mcu_gpio_cfg_t cfg )
{
    for( int i = 0; i < SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE; i++ )
    {
        if( gpio_inst_array[i].is_cfged == true )
        {
            if( ( gpio_inst_array[i].port == cfg->port ) && ( gpio_inst_array[i].pin == cfg->pin ) )
            {
                return true;
            }
        }
    }

    return false;
}

static struct smtc_hal_mcu_gpio_inst_s* smtc_hal_mcu_gpio_stm32l4_get_free_slot( void )
{
    for( int i = 0; i < SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE; i++ )
    {
        if( gpio_inst_array[i].is_cfged == false )
        {
            return &gpio_inst_array[i];
        }
    }

    return NULL;
}

static bool smtc_hal_mcu_gpio_stm32l4_is_real_inst( smtc_hal_mcu_gpio_inst_t inst )
{
    for( int i = 0; i < SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE; i++ )
    {
        if( inst == &gpio_inst_array[i] )
        {
            return true;
        }
    }

    return false;
}

static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_enable_clock( GPIO_TypeDef* port )
{
    if( port == GPIOA )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOA );
    }
    else if( port == GPIOB )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOB );
    }
    else if( port == GPIOC )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOC );
    }
    else if( port == GPIOD )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOD );
    }
#if defined( GPIOE )
    else if( port == GPIOE )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOE );
    }
#endif
#if defined( GPIOF )
    else if( port == GPIOF )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOF );
    }
#endif
#if defined( GPIOG )
    else if( port == GPIOG )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOG );
    }
#endif
#if defined( GPIOH )
    else if( port == GPIOH )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOH );
    }
#endif
#if defined( GPIOI )
    else if( port == GPIOI )
    {
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOI );
    }
#endif
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_disable_clock( GPIO_TypeDef* port )
{
    if( port == GPIOA )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOA );
    }
    else if( port == GPIOB )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOB );
    }
    else if( port == GPIOC )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOC );
    }
    else if( port == GPIOD )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOD );
    }
#if defined( GPIOE )
    else if( port == GPIOE )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOE );
    }
#endif
#if defined( GPIOF )
    else if( port == GPIOF )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOF );
    }
#endif
#if defined( GPIOG )
    else if( port == GPIOG )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOG );
    }
#endif
#if defined( GPIOH )
    else if( port == GPIOH )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOH );
    }
#endif
#if defined( GPIOI )
    else if( port == GPIOI )
    {
        LL_AHB2_GRP1_DisableClock( LL_AHB2_GRP1_PERIPH_GPIOI );
    }
#endif
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_get_exti_cfg( smtc_hal_mcu_gpio_inst_t          inst,
                                                                     smtc_hal_mcu_gpio_irq_exti_cfg_t* exti_cfg )
{
    if( inst->pin == LL_GPIO_PIN_0 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_0;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE0;
        exti_cfg->irq_number       = EXTI0_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_1 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_1;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE1;
        exti_cfg->irq_number       = EXTI1_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_2 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_2;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE2;
        exti_cfg->irq_number       = EXTI2_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_3 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_3;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE3;
        exti_cfg->irq_number       = EXTI3_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_4 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_4;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE4;
        exti_cfg->irq_number       = EXTI4_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_5 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_5;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE5;
        exti_cfg->irq_number       = EXTI9_5_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_6 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_6;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE6;
        exti_cfg->irq_number       = EXTI9_5_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_7 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_7;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE7;
        exti_cfg->irq_number       = EXTI9_5_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_8 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_8;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE8;
        exti_cfg->irq_number       = EXTI9_5_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_9 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_9;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE9;
        exti_cfg->irq_number       = EXTI9_5_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_10 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_10;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE10;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_11 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_11;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE11;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_12 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_12;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE12;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_13 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_13;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE13;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_14 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_14;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE14;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else if( inst->pin == LL_GPIO_PIN_15 )
    {
        exti_cfg->exti_line        = LL_EXTI_LINE_15;
        exti_cfg->syscfg_exti_line = LL_SYSCFG_EXTI_LINE15;
        exti_cfg->irq_number       = EXTI15_10_IRQn;
    }
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst->port == GPIOA )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTA;
    }
    else if( inst->port == GPIOB )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTB;
    }
    else if( inst->port == GPIOC )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTC;
    }
    else if( inst->port == GPIOD )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTD;
    }
#if defined( GPIOE )
    else if( inst->port == GPIOE )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTE;
    }
#endif
#if defined( GPIOF )
    else if( inst->port == GPIOF )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTF;
    }
#endif
#if defined( GPIOG )
    else if( inst->port == GPIOG )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTG;
    }
#endif
#if defined( GPIOH )
    else if( inst->port == GPIOH )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTH;
    }
#endif
#if defined( GPIOI )
    else if( inst->port == GPIOI )
    {
        exti_cfg->syscfg_exti_port = LL_SYSCFG_EXTI_PORTI;
    }
#endif
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

