Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_gpio_stm32l4.c
static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_get_trigger( smtc_hal_mcu_gpio_irq_mode_t mode,
                                                                    uint32_t*                    trigger )
{
    switch( mode )
    {
    case SMTC_HAL_MCU_GPIO_IRQ_MODE_OFF:
    {
        *trigger = LL_EXTI_TRIGGER_NONE;
        break;
    }
    case SMTC_HAL_MCU_GPIO_IRQ_MODE_RISING:
    {
        *trigger = LL_EXTI_TRIGGER_RISING;
        break;
    }
    case SMTC_HAL_MCU_GPIO_IRQ_MODE_FALLING:
    {
        *trigger = LL_EXTI_TRIGGER_FALLING;
        break;
    }
    case SMTC_HAL_MCU_GPIO_IRQ_MODE_RISING_FALLING:
    {
        *trigger = LL_EXTI_TRIGGER_RISING_FALLING;
        break;
    }
    default:
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

static smtc_hal_mcu_status_t smtc_hal_mcu_gpio_stm32l4_call_exti_callback( uint32_t pin )
{
    for( uint32_t i = 0; i < SMTC_HAL_MCU_GPIO_STM32L4_ARRAY_SIZE; i++ )
    {
        if( pin == gpio_inst_array[i].pin )
        {
            if( gpio_inst_array[i].irq_cfg.is_irq_enabled == true )
            {
                if( gpio_inst_array[i].irq_cfg.input_cfg.callback != NULL )
                {
                    gpio_inst_array[i].irq_cfg.input_cfg.callback( gpio_inst_array[i].irq_cfg.input_cfg.context );
                    return SMTC_HAL_MCU_STATUS_OK;
                }
            }
        }
    }
    return SMTC_HAL_MCU_STATUS_ERROR;
}

/**
 * @brief This function handles EXTI line0 interrupt.
 */
void EXTI0_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_0 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_0 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_0 );
    }
}

/**
 * @brief This function handles EXTI line1 interrupt.
 */
void EXTI1_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_1 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_1 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_1 );
    }
}

/**
 * @brief This function handles EXTI line2 interrupt.
 */
void EXTI2_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_2 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_2 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_2 );
    }
}

/**
 * @brief This function handles EXTI line3 interrupt.
 */
void EXTI3_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_3 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_3 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_3 );
    }
}

/**
 * @brief This function handles EXTI line4 interrupt.
 */
void EXTI4_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_4 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_4 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_4 );
    }
}

/**
 * @brief This function handles EXTI line[9:5] interrupts.
 */
void EXTI9_5_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_5 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_5 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_5 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_6 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_6 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_6 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_7 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_7 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_7 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_8 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_8 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_8 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_9 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_9 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_9 );
    }
}

/**
 * @brief This function handles EXTI line[15:10] interrupts.
 */
void EXTI15_10_IRQHandler( void )
{
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_10 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_10 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_10 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_11 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_11 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_11 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_12 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_12 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_12 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_13 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_13 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_13 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_14 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_14 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_14 );
    }
    if( LL_EXTI_IsActiveFlag_0_31( LL_EXTI_LINE_15 ) != RESET )
    {
        LL_EXTI_ClearFlag_0_31( LL_EXTI_LINE_15 );
        smtc_hal_mcu_gpio_stm32l4_call_exti_callback( LL_GPIO_PIN_15 );
    }
}

/* --- EOF ------------------------------------------------------------------ */
